app/controllers/carts_controller.rb

  def top
    @cart_product = Cart.all.order(created_at: :desc)
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC

  def delete
    @cart = Cart.find_by(product_id: params[:id])

    if @cart
      @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."product_id" = ? LIMIT ?  [["product_id", 2], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 19]]