app/controllers/products_controller.rb

  def set_current_product
    @current_product = Product.find_by(id: session[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def cart

      @cart =Cart.new(product_id: @current_product.id)

      if @cart.save
---
INSERT INTO "carts" ("product_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["product_id", 2], ["created_at", "2023-02-04 14:01:55.865585"], ["updated_at", "2023-02-04 14:01:55.865585"]]