app/controllers/purchase_controller.rb

    def top
      @cart_product = Cart.all.order(created_at: :desc)
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC

    def create

      if @current_user == nil
      @purchase=Purchase.new(name: params[:name], address: params[:address], email: params[:email])
      @purchase.save
---
INSERT INTO "purchases" ("product_id", "user_id", "created_at", "updated_at", "name", "email", "address") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", nil], ["user_id", nil], ["created_at", "2023-02-05 12:44:05.101689"], ["updated_at", "2023-02-05 12:44:05.101689"], ["name", "しほ"], ["email", "shiho"], ["address", "a"]]

    def deal
      @cart_product = Cart.all.order(created_at: :desc)
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC

    def credit

      @credit=Deal.new(due_number: params[:due_number], card_name: params[:card_name], card_password: params[:card_password], card_number: params[:card_number])
      if @credit.save
---
INSERT INTO "deals" ("due_number", "card_name", "card_password", "purchase_id", "created_at", "updated_at", "card_number") VALUES (?, ?, ?, ?, ?, ?, ?)

  def check
      @cart_product = Cart.all.order(created_at: :desc)
      @purchase =Purchase.find_by(id: 1)
      @deal =Deal.find_by(id: 1)
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def action
      Cart.destroy_all

      Purchase.destroy_all

      Deal.destroy_all

      if Deal.exists? and Purchase.exists?
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 21]]
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]
DELETE FROM "deals" WHERE "deals"."id" = ?  [["id", 1]]
SELECT "purchases".* FROM "purchases"
SELECT "deals".* FROM "deals"
SELECT 1 AS one FROM "deals" LIMIT ?  [["LIMIT", 1]]