app/controllers/users_controller.rb

    def update
      @user = User.find_by(id: params[:id])
      @user.name = params[:name]
      @user.email = params[:email]
      @user.password = params[:password]

      if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["name", "しほ"], ["email", "shiho"], ["updated_at", "2023-02-05 10:15:14.611215"], ["password_digest", "[FILTERED]"], ["id", 7]]

    def create
      @user = User.new(
        name: params[:name],
        email: params[:email],
        password: params[:password]
      )
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "e"], ["email", "e"], ["created_at", "2023-08-02 16:28:12.562288"], ["updated_at", "2023-08-02 16:28:12.562288"], ["password_digest", "[FILTERED]"]]