app/models/cart.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def products
    return Product.find_by(id: self.product_id)